//
//  ViewController.m
//  SDAutolayouttableView练习
//
//  Created by myh on 16/5/14.
//  Copyright © 2016年 ltygs. All rights reserved.
//
#define kHEIGHT [UIScreen mainScreen].bounds.size.height
#import "MyhCell.h"
#import "ViewController.h"
#import "MYHSliderChangeLabelFont.h"
#import <UITableView+SDAutoTableViewCellHeight.h>

@interface ViewController ()<UITableViewDelegate,UITableViewDataSource>{

    UITableView *_tableView;

}
@property(nonatomic,strong)MYHSliderChangeLabelFont *slider ;
@end

@implementation ViewController
- (MYHSliderChangeLabelFont *)slider{
    
    if (_slider ==nil) {
        _slider = [[MYHSliderChangeLabelFont alloc]init];
    }
    
    return _slider;
    
}

- (void)viewDidLoad {
    [super viewDidLoad];
    
        [self setupUI];
   

}

-(void)setupUI{
    
    
    
    _tableView = [[UITableView alloc]initWithFrame:CGRectMake(0, 0, self.view.frame.size.width, kHEIGHT)];
    _tableView.delegate = self;
    _tableView.dataSource = self;
    [self.view addSubview:_tableView];

    
      [ self.slider setupSliderWithFrame:CGRectMake(0, 100, 150, 30) addView:self.view  minValue:12 maxValue:25 currentValue:12];
    [_tableView registerClass:[MyhCell class] forCellReuseIdentifier:@"cell"];
    UIButton *button=[[UIButton alloc]initWithFrame:CGRectMake(100, 250, 100, 50)];
    [button setTitle:@"刷新" forState:UIControlStateNormal];
    [button setTitleColor:[UIColor blackColor] forState:UIControlStateNormal];
    [button addTarget:self action:@selector(onClicked) forControlEvents:UIControlEventTouchDown];
    [self.view addSubview:button];
    
}
- (CGFloat)tableView:(UITableView *)tableView heightForRowAtIndexPath:(NSIndexPath *)indexPath{
    return [self cellHeightForIndexPath:indexPath cellContentViewWidth:[UIScreen mainScreen].bounds.size.width tableView:_tableView];

}
- (NSInteger)tableView:(UITableView *)tableView numberOfRowsInSection:(NSInteger)section{
    
    
    return 3;
}
- (UITableViewCell *)tableView:(UITableView *)tableView cellForRowAtIndexPath:(NSIndexPath *)indexPath{
    
    static NSString *ID = @"cell";
    MyhCell *cell = [tableView dequeueReusableCellWithIdentifier:ID ];
 
    
    
    if (indexPath.row == 0) {
       [cell.NameLabel sizeToFit];
        cell.NameLabel.text = @"1111111111111111111111111111111111111111111111111222222222222222222222111111111111111111111111111111111111111111122222222222111111111111111111111111111111111111111111122222222222111111111111111111111111111111111111111111122222222222111111111111111111111111111111111111111111122222222222111111111111111111111111111111111111111111122222222222222";
           cell.detailLabel.text = @"我是上部$$$$$$$$$$$$$$$$$$$";
      
    }else if(1 == indexPath.row){
        [cell.NameLabel sizeToFit];
        
    cell.NameLabel.text = @"5555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555";
    
      cell.detailLabel.text = @"我是中部$$$$$$$$$$$$$$$$$$$";
    }
    else if (2 == indexPath.row){
    cell.NameLabel.text = @"我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的我是最底部的";
    
     cell.detailLabel.text = @"我是底部$$$$$$$$$$$$$$$$$$$";
    }
    
    cell.imageViews.image = [UIImage imageNamed:@"avatar"];
    
        cell.textLabel.backgroundColor = [UIColor blueColor];
    
    
    
    return cell;
}
- (void)onClicked{


    [_tableView reloadData];

}
@end
